XuanKyVN/Water-level-control-by-ESP32/WaterLevelControl/ESP32XML_WriteRead/ESP32XML_WriteRead.ino
  
  // Chuong trinh giam sat va dieu khien muc Nuoc trong Be LORA
  //Chuong trinh co the cai dat cho ESP8266 hoac ESP32
#define BLYNK_TIMEOUT_MS  30000  // must be BEFORE BlynkSimpleEsp8266.h doesn't work !!!
#define BLYNK_HEARTBEAT   1700
#include <XMLWriter.h>
char buffer[24];

#if defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <FS.h>
#include "LittleFS.h"
#define Filesystem LittleFS
#include <BlynkSimpleEsp8266.h>
int Dout[]={5,4,13,15}; // Pump,AutoMan,Overload,CBtrip
int Din[] ={0,16}; // Overload , TripCB

//#include <SoftwareSerial.h>
//SoftwareSerial mySerial(13, 15); //Define hardware connections 13,15

#elif defined(ARDUINO_ARCH_ESP32)
#include <WiFi.h>
#include <WiFiClient.h>
#include <BlynkSimpleEsp32.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <FS.h>
#define Filesystem LITTLEFS
#include "LITTLEFS.h"
uint64_t chipid32;  
int Dout[] ={33,32,25,26}; // 25 Overload indicator, 26 CB trip Indicator
int Din[] ={35,34,27}; // Overload , TripCB, disBlk_mqtt pin27
#define RXD2 16
#define TXD2 17

#endif
//Add a below line for AutoConnect.
#include <AutoConnect.h>
#include <EEPROM.h>
//----------------------------------
#define DBG_OUTPUT_PORT Serial
const char* ssid;
const char* passwordwifi;
#if defined(ARDUINO_ARCH_ESP8266)
//const char* host = "esp8266fs";
String host = "esp8266fs";
ESP8266WebServer server(80);
#elif defined(ARDUINO_ARCH_ESP32)
//const char* host = "esp32fs";
String host = "esp32fs";
WebServer server(80);
#endif
//-------------------------------
//Add a below line for AutoConnect.
AutoConnect       portal(server);
AutoConnectConfig config;
// NPT Time Client Reading
//-------------------------
#include <Pushbutton.h>

#if defined(ARDUINO_ARCH_ESP8266)
Pushbutton button1(14); //Button Start/Stop
Pushbutton button2(12); // Button Auto/Man


#elif defined(ARDUINO_ARCH_ESP32)
Pushbutton button1(22);//Button Start/Stop
Pushbutton button2(23); // Button Auto/Man
#endif
bool state1 = 1;        // Save trang thai button 1
bool state2 = 1;
// Globle variable
int addr = 700; // address of eeprom
//#define LED  16 // Display the AP running status //D0 tren con V1 NodeMCU  
const int RSSI_MAX =-50;// define maximum strength of signal in dBm
const int RSSI_MIN =-100;// define minimum strength of signal in dBm
// state[10]; byte lightState[10];
uint8_t retry = 5;
unsigned int  Interval = 10000; // 10sec
unsigned long lastPub = 0;
//--------------------Tank------
//Readback = {"TankMax": 5.0, "SetStart": 0.0, "SetStop": 2.0, "AutoMan": 0, "Operate":0, "Level": 3.0, CBTrip_Off:0, Overload: 0, wifiSig:100};
float TankMax= 5.9 ,SetStart=1.3,SetStop=4.5 ,Level=2.3;
float TankMaxset,Startset, Stopset;
uint8_t AutoMan,Operate,CBTrip_Off,Overload;
bool last_state, enb_Blk_Mqtt;
//-------------------------------------
#include "NtpReadSerial.h"
//--------------------------------------
//--------------------------------------
#include "WebPageFS.h"
//MQTT//--------------------------MQTT------------------------------------------------
#include "Mqtt.h"
//------------  BLYNK------------------------------------------------------BLYNK-----
#include "Blynk.h"
//-------------------------------------END BLYNK-------------------------------------

void handle_setupdata(){
   String dataname[20];
   String datasetup[20];
   String fbwebsetup;
   if (server.args() > 0 ) { // Arguments were received
    for ( uint8_t i = 0; i < server.args(); i++ ) {
      dataname[i] = server.argName(i);
      datasetup[i] = server.arg(i);
      //Serial.print(dataname[i]);
      //Serial.print(": ");
      //Serial.println(datasetup[i]);
        }

    //-----------------------------------------------MQTT-------------------------------
    if (dataname[0].indexOf("mqtt") >=0){ // neu data nhan duoc la mqtt setup, trong chuoi co mqtt
      mqttserver=datasetup[0];
      channelid=datasetup[1];
      username=datasetup[2];
      PassWord=datasetup[3];
      TopicPub=datasetup[4];
      TopicSub=datasetup[5];
      updateInterval=datasetup[6];
      MqttEnable=datasetup[7];
      fbwebsetup = "<html><body><h3> MQTT Setting Value </h3>";
      fbwebsetup += "<p>MQTT Server is: " +  mqttserver + " <br>";
      fbwebsetup+= "MQTT Channel ID is: " + channelid +"<br> ";
      fbwebsetup+= "MQTT username is: " +username+" <br>";
      fbwebsetup+= "MQTT password: " +PassWord+" <br>";
      fbwebsetup+= "Topic Subscribe: " +username+"/"+channelid +"/"+  TopicSub+" <br>";
      fbwebsetup+= "Topic publish: " +username+"/"+channelid +"/"+ TopicPub+" <br>";
      fbwebsetup+="Update interval: "+ updateInterval+" <br>";
      fbwebsetup+="Mqtt Enable is: "+MqttEnable+" <br></p>";
      fbwebsetup  += "<a href=\"/setup\"> Setting </a> <br>";
      fbwebsetup+= "<a href=\"/\"> Home</a> <body><html>";
      
      String a = MqttEnable;
      if (a == "Enable") {
        EnbValMqtt = true; // see the API Autoconnect
        Serial.println("Enable MQTT, Writing data to OR EEPROM");
      }
      else {
      EnbValMqtt = false;
      Serial.println("MQTT Disabled from server");
      }

      MqttwriteFLASH();
       
    }
  
    
    //--------------------------------------------------------BLYNK-------------------------------------
    else{ //nguoc lai ko phai la mqtt, thi la blynk set
      BLYNKServer= datasetup[0];
      Auth_Token=  datasetup[1];
      PORT=        datasetup[2];
      Interval_blk=datasetup[3];
      BlynkEnable=datasetup[4];
      fbwebsetup = "<html><body><h3> BLYNK Setting Value </h3>";
      fbwebsetup  += "<p>Blynk server is: " + BLYNKServer+" <br>"; 
      fbwebsetup  += "Blynk authorize token is: "+Auth_Token+" <br>";
      fbwebsetup  += "Blynk Port is: " +PORT+" <br>";
      fbwebsetup  += "Update interval is: "+Interval_blk+" <br>";
      fbwebsetup  += "Blynk Enable is: "+BlynkEnable+" <br></p>";
      fbwebsetup  += "<a href=\"/setup\"> Setting </a><br> ";
      fbwebsetup  += "<a href=\"/\"> Home</a> <body><html>";
      //Serial.println(fbwebsetup);
      String a =BlynkEnable;
      
