XuanKyVN/Water-level-control-by-ESP32/WaterLevelControl/ESP32XML_WriteRead/ESP32XML_WriteRead.ino
    if (a=="Enable"){ // see the API Autoconnect
      EnbVal=0;   // this valvue use to limit the blynk configuration loop only one time during configuration
      if (EnbVal==0) { enableblynk = true; Serial.println("Blynk Enabled");}
      else { enableblynk = false; Serial.print("blynk running");}
     }    
      else { enableblynk=false;EnbVal=0; Serial.println("Blynk Disabled from server");
      } 
    
    BlynkwriteFLASH(); 
    
    }// Ket thuc neu La BLYNK     

   }
    
    server.send(200, "text/html", fbwebsetup);
}

//-----------------------------------------------------------
bool whileCP(void) {
  bool  rc;
  // Here, something to process while the captive portal is open.
  // To escape from the captive portal loop, this exit function returns false.
  // rc = true;, or rc = false;
   //rc = false;
        config.immediateStart=true;
        portal.config(config);
        rc = true;
    return rc;
}
//----------------------
bool SetupwriteFLASH(StaticJsonDocument<200> doc) {  // save data in flash                       
   
  File DataFile = Filesystem.open("/setdata.txt", "w");
  if (!DataFile) {
    Serial.println("Failed to write Setdata.txt file");
    return false;
  }
  serializeJson(doc, DataFile);
    DataFile.close();
  return true;

 Serial.println("Write Setting Data to FLASH Sussesful");    
}

//---------------
void readSetupdata(StaticJsonDocument<200> doc){
      TankMax=    doc["TankMax"].as<float>();       
      SetStart=   doc["SetStart"].as<float>();       
      SetStop=    doc["SetStop"].as<float>(); 
      AutoMan=    doc["AutoMan"].as<uint8_t>(); 
}
//---------------
bool read_SetData_FLASH(){
           
 File DataFile = Filesystem.open("/setdata.txt", "r");
  if (!DataFile) {
    Serial.println("Failed to read Setdata.txt file");
    return false;
  }

  size_t size = DataFile.size();
  if (size > 1024) {
    Serial.println("Config file size is too large");
    return false;
  }

  // Allocate a buffer to store contents of the file.
  std::unique_ptr<char[]> buf(new char[size]);

  // We don't use String here because ArduinoJson library requires the input
  // buffer to be mutable. If you don't use ArduinoJson, you may as well
  // use DataFile.readString instead.
  DataFile.readBytes(buf.get(), size);

  StaticJsonDocument<200> doc;
  auto error = deserializeJson(doc, buf.get());
  if (error) {
    Serial.println("Failed to parse Set data config file");
    return false;
  }
        readSetupdata(doc);
      
      Serial.println("Tank Max is: "+String(TankMax));
      Serial.println("Set Start   is: " +String(SetStart));
      Serial.println("Set Stop   is: " +String(SetStop));
      Serial.println("Auto/Manual is: " +String(AutoMan));
      
      
 DataFile.close(); // Khi mo File ra thi phai CLOSE FILE lai, Neu ko se ko doc ghi dc nua
 //return true;

}



//--------------------------------------------------------------------------------------- SPIFFS DATA SAVE------------------------
void handle_setState() {
  String temp;
   if (server.args() > 0 ) { // Arguments were received
    for ( uint8_t i = 0; i < server.args(); i++ ) {
      temp = server.argName(i);
      String data_input = server.arg(i);
      // Serial.print(server.argName(i)); // Display the argument =
      if (temp=="Operate"){
        int valdata=data_input.toInt();
        if (valdata==0){          
           digitalWrite(Dout[0],LOW); //LED ON
            Operate=0;       
        }              
               else
               {
                digitalWrite(Dout[0],HIGH); //LED OFF
                Operate=1;
                }
        }            
      //--------------------------
        if (temp=="SetAuto"){
          int valdata=data_input.toInt();
        if (valdata==0){           
           digitalWrite(Dout[1],LOW); //LED ON
          AutoMan =0;
          }              
               else
               {
                digitalWrite(Dout[1],HIGH); //LED OFF
                AutoMan=1;
                }
        }     
        //--------------------------
      if (temp=="SetOperate"){
        
        StaticJsonDocument<200> doc;//V6
      deserializeJson(doc, data_input);
      //{"TankMax": 5.5, "SetStart":1.5 , "SetStop": 4.5, "AutoMan": 0}
     serializeJson(doc, Serial);        

     SetupwriteFLASH(doc); 
     readSetupdata(doc);  
      }


        
         
  }             
 }

 handle_FBtoWeb();
}      
     
    //----------------------------------------=-------------

void handle_FBtoWeb(){
       uint8_t state[5];
          
          for (int i=0; i<2;i++){
          if (digitalRead(Dout[i])){              
                state[i] = 1;
               }
               else
               {
                state[i] = 0;  
               }
          }
          // state[0] Pump OFF/ON ; State[1] : Man/Auto
          Operate= state[0];
          AutoMan= state[1];
  String webPage;

  
 StaticJsonDocument<300> doc;//V6
  // Create the root object

//Readback = {"TankMax": 5.0, "SetStart": 0.0, "SetStop": 2.0, "AutoMan": 0, "Operate":0, "Level": 3.0, CBTrip_Off:0, Overload: 0, wifiSig:100};
  doc["TankMax"]=TankMax;
  doc["SetStart"]=SetStart;
  doc["SetStop"]=SetStop;
  doc["AutoMan"]=AutoMan;
  doc["Operate"]=Operate;
  doc["Level"]=Level;
  doc["CBTrip_Off"]=CBTrip_Off;
  doc["Overload"]=Overload;
  doc["blk"]=enableblynk;
  doc["blkst"]=BlkStatus;
  doc["mqtt"]=EnbValMqtt;
  doc["mqttst"]=MqttStatus;
   
    // sent wifi signal to web
   String RssiSent = String(dBmtoPercentage(WiFi.RSSI()));
   doc["wifiSignal"] = RssiSent;
    
  serializeJson(doc, webPage);
  //serializeJson(doc, Serial); // in ra Serial
  //server.send(200, "application/json", webPage);
  server.send(200, "text/json", webPage);
 }

//-------------------------------------------------
void handle_datasetupdisplay(){
   String Setup_fb;  // feedback data setup to Webpage Setup
  StaticJsonDocument<500> doc;//V6
  // Create the root object
// HOST NAME SENT to Client
  doc["HostName"]= String(host);
  doc["IP"]= (WiFi.localIP()).toString();
//MQTT JSON DATA for MQTT
    doc["Mq_server"]= mqttserver;
    doc["Mq_Channel"]= channelid;
    doc["Mq_username"]= username;
    doc["Mq_password"]= PassWord;
    doc["Mq_TopicPub"]= TopicPub;
    doc["Mq_TopicSub"]= TopicSub;
    doc["mq_updateinterval"]=updateInterval;

    doc["Mq_enable"]= MqttEnable;
//BLYNK JSON DATA
    doc["blk_server"]= BLYNKServer;
    doc["blk_auth"]= Auth_Token;
    doc["blkPort"]= PORT;
    doc["blk_interval"]= Interval_blk;
    doc["BlkENB"]= BlynkEnable;
   
    
  serializeJson(doc, Setup_fb);
 // serializeJson(doc, Serial); // in ra Serial
 // server.send(200, "application/json", webPage);
  server.send(200, "text/json", Setup_fb);
}


//----------END----------------------------------------
bool handleFileRead(String path) {
  DBG_OUTPUT_PORT.println("handleFileRead: " + path);
  if (path.endsWith("/")) {
    path += "/index.htm";
  }
  String contentType = getContentType(path);
  String pathWithGz = path + ".gz";
 
