XuanKyVN/Water-level-control-by-ESP32/WaterLevelControl/ESP32XML_WriteRead/ESP32XML_WriteRead.ino
  if (Filesystem.exists(pathWithGz) || Filesystem.exists(path)) {
    if (Filesystem.exists(pathWithGz)) {
      path += ".gz";
    }
    File file = Filesystem.open(path, "r");

    server.streamFile(file, contentType);
    file.close();
    return true;
  }
  return false;
}
String getContentType(String filename) {
  if (server.hasArg("download")) {
    return "application/octet-stream";
  } else if (filename.endsWith(".htm")) {
    return "text/html";
  } else if (filename.endsWith(".html")) {
    return "text/html";
  } else if (filename.endsWith(".css")) {
    return "text/css";
    } else if (filename.endsWith(".csv")) {
    return "text/csv";
  } else if (filename.endsWith(".js")) {
    return "application/javascript";
  } else if (filename.endsWith(".png")) {
    return "image/png";
  } else if (filename.endsWith(".gif")) {
    return "image/gif";
  } else if (filename.endsWith(".jpg")) {
    return "image/jpeg";
  } else if (filename.endsWith(".ico")) {
    return "image/x-icon";
  } else if (filename.endsWith(".xml")) {
    return "text/xml";
  } else if (filename.endsWith(".pdf")) {
    return "application/x-pdf";
  } else if (filename.endsWith(".zip")) {
    return "application/x-zip";
  } else if (filename.endsWith(".gz")) {
    return "application/x-gzip";
  }
  return "text/plain";
}
//---------------------------------
void onConnect(IPAddress& ipaddr) {
  Serial.print("WiFi connected with ");
  Serial.println(WiFi.SSID());
  Serial.print("WiFi Password: ");
  Serial.println(WiFi.psk());
  Serial.print(", IP:");
  Serial.println(ipaddr.toString());
//Serial.printf("password: %s ", WiFi.psk().c_str() ); // conver to String
//Serial.printf("RSSI: %d dBm\n", WiFi.RSSI());
//Serial.printf("SSID: %s\n", WiFi.SSID().c_str());
  ssid =WiFi.SSID().c_str(); // constant char*
  passwordwifi= WiFi.psk().c_str();
}
//---------------------------------------------------
void setup(void){
    //-----------
  DBG_OUTPUT_PORT.begin(115200);
  DBG_OUTPUT_PORT.print("\n");
  DBG_OUTPUT_PORT.setDebugOutput(true);
  // Pin Mode
   for (int i=0;i<4;i++){
  pinMode(Dout[i],OUTPUT);
  
 }
  for (int i=0;i<3;i++){
  pinMode(Din[i],INPUT_PULLUP);
  
 }
//EEPROM.begin(addr);  //Initialize EEPROM
mqttClient.setCallback(callback);
timer.setInterval(10000L, CheckConnection); // check if still connected every 60s  BLYNK
timer1.setInterval(3000L, Send_Blk_Mqtt);

  #ifdef ESP8266
  config.apid = "ESP-" + String(ESP.getChipId(), HEX);
  host = "esp-" + String(ESP.getChipId(), HEX);
  //mySerial.begin(9600);
  
  #else //ESP32
  chipid32=ESP.getEfuseMac();//The chip ID is essentially its MAC address(length: 6 bytes).
  uint16_t a= chipid32>>32; // lay 2byte phia tren
  host="esp-"+String(a,DEC);
  
  Serial2.begin(9600, SERIAL_8N1, RXD2, TXD2); //Define Serial 2 Pin
  #endif
  Serial.println("Enter link below to enter webserver");Serial.print(host); Serial.println(".local");
  config.psk = 12345678;
  config.title = "ESP-Setup";
  portal.config(config);
  
  //config.portalTimeout = 30000;  // Captive Portal Se bi mat sau thoi gian 30s. neu Wifi Mat, captive Portal se chay va thoat trong 30s neu ko lam j het.
  config.ota = AC_OTA_BUILTIN;
  portal.config(config);
  
  //config.autoRise = false;  // Mac dinh True
  //config.retainPortal = true; //mac dinh faulse
  // config.autoReset = true;
  //----------------------------------------------------------------------------
  config.autoReconnect = true;    // hai ham nay phai di chung voi nhau
  config.reconnectInterval = 2; // Reconnection attempting interval is 1min.
  //----------------------------------------------------------------------------
  config.ticker = true;  // Wifi status
  config.tickerPort = 2; // 
  config.tickerOn = LOW;
  /*Short blink: The ESP module stays in AP_STA mode.
  Short-on and long-off: No STA connection state. (i.e. WiFi.status != WL_CONNECTED)
  No blink: WiFi connection with access point established and data link enabled. (i.e. WiFi.status = WL_CONNECTED)*/
  //---------------------------------
  
  portal.config(config);
  config.menuItems = AC_MENUITEM_CONFIGNEW | AC_MENUITEM_OPENSSIDS | AC_MENUITEM_RESET | AC_MENUITEM_UPDATE | AC_MENUITEM_HOME;
  portal.config(config);

   #ifdef ESP8266
  if (!Filesystem.begin()) {
  #else
  if (!Filesystem.begin(true)) {
  #endif  
    Serial.println("SPIFFS initialisation failed...");
    SPIFFS_present = false; 
  }else{
    Serial.println(F("SPIFFS initialised... file access enabled..."));
    SPIFFS_present = true; 
    
    Filesystem.remove("data.xml");
    writexml();
    }
  
  
//---------------------------------------------------------------------------
   
   portal.onNotFound([](){
    if(!handleFileRead(server.uri()))
      server.send(404, "text/plain", "Website not found , Please contact to phamxuanky82@gmail.com");
  });
// filesystem will be LittleFS if ESP8266, LITTLEFS if ESP32
  server.serveStatic("/setup", Filesystem, "/setup.htm");  // su dung .htm ko su dung html de EDIT duoc
  server.serveStatic("/about",Filesystem,"/about.htm"); // Update Analog value power
   
  server.on("/setupdata_display", handle_datasetupdisplay);
  server.on("/setup_data",handle_setupdata); // update pin value to server
  server.on("/FBtoWeb", handle_FBtoWeb);
  server.on("/setState", handle_setState); // handles button values
  
  
  
///////////////////////////// Server Commands SPIFFS
  server.on("/fs_read",         HomePage);
  server.on("/download", File_Download);
  server.on("/upload",   File_Upload);
  server.on("/fupload",  HTTP_POST,[](){ server.send(200);}, handleFileUploadFS);
  server.on("/stream",   File_Stream);
  server.on("/delete",   File_Delete);
  server.on("/dir",      SPIFFS_dir);

  //Relocation as follows to make AutoConnect recognition.
 portal.whileCaptivePortal(whileCP);   // HAM NAY GIUP KEEP TRACKING WIFI ALL TIME NHE CAC BAN, Neu ko co ham nay thi ko dc nhe
      if (portal.begin()) {
    DBG_OUTPUT_PORT.print(F("Connected! IP address: "));
    DBG_OUTPUT_PORT.println(WiFi.localIP());
    config.immediateStart=false;
    portal.config(config);
  }
  DBG_OUTPUT_PORT.println("HTTP server started");
  if (MDNS.begin(host.c_str())) {
    MDNS.addService("http", "tcp", 80);
    DBG_OUTPUT_PORT.print(F("Open http://"));
    DBG_OUTPUT_PORT.print(host);
    DBG_OUTPUT_PORT.println(F(".local/edit to open the webserver"));
  }
  portal.onConnect(onConnect); 
//---------------------------------
read_MQTT_FLASH_Started(); // READ EEPROM during CPU Reset power supply
read_Bink_FLASH_Started();
read_SetData_FLASH();  
//--------------------
// Initialize a NTPClient to get time
  timeClient.begin();
  // Set offset time in seconds to adjust for your timezone, for example:
  // GMT +1 = 3600
  // GMT +8 = 28800
  // GMT -1 = -3600
  // GMT 0 = 0
  //timeClient.setTimeOffset(0);
timeClient.setTimeOffset(+7*60*60); // VietNam Gmt +7
timeClient.update();  // CAP NHAT THOI GIAN LUC CAU HINH XONG

