XuanKyVN/Water-level-control-by-ESP32/WaterLevelControl/ESP32XML_WriteRead/ESP32XML_WriteRead.ino
}
//----------------------------

void readserial(){
  if (Serial.available()>0){    
  String inputdata = Serial.readString();
if(inputdata=="blkdis"){
   enableblynk=false;
   Serial.println("Disable blynk");
}
if(inputdata=="mqdis"){
   EnbValMqtt=false;
      Serial.println("Disable mqtt");
}
if(inputdata=="blkenb"){
   enableblynk=true;
   EnbVal=false;
      Serial.println("enable blynk");
}
if(inputdata=="mqenb"){
   EnbValMqtt=true;
      Serial.println("enable mqtt");
}
  }
} 
//----------------------------
void loop(void){

  portal.handleClient();
#ifdef ARDUINO_ARCH_ESP8266
  MDNS.update();
#endif

//if (WiFi.status() == WL_IDLE_STATUS) {
//#if defined(ARDUINO_ARCH_ESP8266)
//    ESP.reset();
//#elif defined(ARDUINO_ARCH_ESP32)
//    ESP.restart();
//#endif
//    delay(1000);
//  }

if (WiFi.status() == WL_CONNECTED) {
 
//-----------------------------
if(Blynk.connected()){
       if (EnbVal==1){
           Blynk.run();
           
          }
       }
      timer.run();
      timer1.run();
//----------------------------
  if (EnbValMqtt==true&&mqttConnect()==true) { // If Enable to start MQTT Client Client.loop
    mqttClient.loop();
  }
NPT_TimeUpdate();
ReadSerial();
pushbuttonact();
LedWidgetdisplay();
readserial();
}else{
#if defined(ARDUINO_ARCH_ESP32)
    ESP.restart();
#endif
    delay(10000);
}

}
// END OF CHILD PROGRAM------------------------------------

void pushbuttonact(){
  //-----------------------------BUTTON- tac Dong o Muc 0. GND---
if (button1.getSingleDebouncedPress() )
{
state1 =! state1;               //chuyen trang thai Relay 1 PUMP OPERATE
digitalWrite(Dout[0],state1);   // 
Operate=state1;
}
if (button2.getSingleDebouncedPress() )
{
state2 =! state2;               //AutoMANUAL
digitalWrite(Dout[1],state2);
AutoMan=state2;
}
// Enb and Disable Blynk and MQTT

//--------------------------------ReadINPUT ---------
uint8_t stateInput[3];
for (int i=0;i<3;i++){
  if (digitalRead(Din[i])){
    stateInput[i] =1;
  } else{   stateInput[i] =0; }
}

Overload =stateInput[0];
CBTrip_Off=stateInput[1];
digitalWrite(Dout[2],Overload);
digitalWrite(Dout[3],CBTrip_Off);

if (Overload==1|CBTrip_Off==1|Level==TankMax){
  digitalWrite(Dout[0],0);   // 
  Operate=0;
}

if (AutoMan==1){
  
  if(Level>=SetStop){
  digitalWrite(Dout[0],0);   // 
  Operate=0;
} 
  if (Level<=SetStart){
  digitalWrite(Dout[0],1);   // 
  Operate=1;
}

}

   //Enb Blk and Mqtt when server failure, we can access Webserver to config
enb_Blk_Mqtt=stateInput[2];
if (last_state!=enb_Blk_Mqtt){
if (enb_Blk_Mqtt){
  enableblynk=false;BlkStatus=false;
  EnbValMqtt=false; MqttStatus=false;
  Serial.println("Blynk and Mqtt was disabled");
}else{ Serial.println("Blynk and Mqtt Enable");
enableblynk=true; EnbVal=false;
EnbValMqtt=true; 
}
last_state=enb_Blk_Mqtt; // save last state of switch 
}
}
//------------------------XML WRITE LITTLEFS-----------------------------------
// casting to keep some compilers happy
void AnalogPorts(XMLWriter* xw, const char* name)
{
  xw->comment("The analog ports are multiplexed");
  xw->tagOpen("Analog", name);
  xw->writeNode("Analog0", itoa(analogRead(A13), buffer, 10));
  xw->writeNode("Analog1", (uint16_t) analogRead(A12));
  xw->writeNode("Analog2", (double) (5.0*analogRead(A14))/1023);  // default nr decimals = 2
  //xw->writeNode("Analog3", (double) (5.0*analogRead(A2))/1023, (uint8_t)3);
  xw->tagClose();
}

void DigitalPorts(XMLWriter* xw)
{
  xw->comment("The digital ports are not multiplexed");
  xw->tagOpen("Digital");
  xw->writeNode("D27", itoa(digitalRead(1), buffer, 10));
  xw->writeNode("D35", (uint8_t)digitalRead(35));
  xw->tagClose();
}

bool writexml(){  
  uint32_t start = micros();
  File DataFile = Filesystem.open("/data.xml", "w");
  if (!DataFile) {
    Serial.println("Failed to write Setdata.xml file");
    return false;
  }
  
  XMLWriter XML(&DataFile);
  XML.header();
  XML.comment("XMLWriterSDcard.ino\nThis is a demo of a simple XML lib for Arduino", true);
  XML.tagOpen("Arduino", "42");
  XML.tagOpen("Ports");
  AnalogPorts(&XML, "measurement");
  DigitalPorts(&XML);
  XML.tagClose();
  XML.tagClose();
  XML.flush();

  DataFile.close();

  uint32_t stop = micros();
  Serial.println();
  Serial.println(stop - start);
  Serial.println("Done...");
  
  
  DataFile.close();
  Serial.println("Write Setting Data xml Sussesful");    
  return true;
}
